import 'package:flutter/material.dart';
import 'package:flutter_html/flutter_html.dart';

class TermsConditionsScreen extends StatelessWidget {
  static const String routeName = '/terms-conditions';

  final test = [
    'سیاسات وإجراءات التعویضات',
    'للعمیل حق الشكوى لمده 120 یوم من تاریخ إرسال الشحنة حق التعویض یكون لمرسل الشحنة',
    'في حاله رغبه المرسل في التنازل عن التعویض للمستلم یكون عن طریق وكالة شرعیة',
    '	فاتورة أصلیة بقیمة المنتج صورة البولیصة  حساب بنكي : التعویض بقیمة المثل وفقا للائحة هیئة الاتصالات ویتوجب على المرسل توفیر الأوراق المطلوبة للتعویض وهي كالاتي',
// وهي كالاتي:
// ●	فاتورة أصلیة بقیمة المنتج
// ●	صورة البولیصة
// ●	حساب بنكي
// ●	وسوف تعتذر شركة هوب إكس عن التعویض في حالة عدم توافر أي من المتطلبات السابقة
// ●	في حالات التلف یحق للمستلم إثبات التلف خلال 24 ساعة من الاستلام وإرفاق صور تثبت حالة الشحنة
// التالفة، في حال شكوى العمیل بعد الوقت المتفق علیه، تعتذر شركة هوب إكس عن قبول الشكوى
// ●	في حالات تأخیر التسلیم عن الوقت المتفق علیه، یتم تعویض العمیل بقیمه الشحن ما عدا الحالات الناتجة عن
// تأخیر بسبب خارج عن الإرادة أو ظروف طارئه أو قوة قاهرة.
//  الآثار المترتبة على عدم تنفیذ الخدمة
// ●	شركة هوب إكس تكون مسؤولة عن الخسارة الناتجة عن تلف أو فقد الطرود وكذلك عن التأخیر في التسلیم إذا
// وقع الحادث الذي سبب التلف أو الفقد أو التأخیر في التسلیم في الوقت الذي كانت فیه الطرود في عهدة شركة
// ساعد، إلا إذا ثبت عدم صدور أي خطا أو إهمال من شركة هوب إكس أو من موظفیها تسبب أو ساهم في
// تأخیر تسلیم الطرود أو خسارتها أو تلفها .كما یمكن إعفاء شركة هوب إكس من المسؤولیة إذا ثبت أن تأخیر
// تسلیم البضاعة أو تلفها كلیا أو جزئیا یعود إلى خطأ صادر عن المرسل أو المرسل إلیه أو وكلائهما أو
// ممثلیهما، أو بسبب قوة قاهرة ،أو بسبب عیب كامن في الطرد. وتعفي أیضا من المسؤولیة لأي سبب آخر خارج
// عن سیطرة شركة هوب إكس ویمنعها من تنفیذ بنو د الاتفاقیة.
// ●	شركة هوب إكس غیر مسؤولة عن التأخر في تسلیم البضاعة أو تلفها أو فقدها إذا كان ذلك نتج عن تقدیم
// المرسل بیانات أو معلومات خاطئة عن طبیعة البضاعة في عقد التوصیل أو وثیقة الشحن ویتحمل المرسل كافة
// الخسائر والأضرار في حالة عدم تقدیمه المستندات الكافیة والبیانات والمعلومات المطلوبة أو عدم صحتها أو
// عدم مطابقتها للواقع.
// شركة هوب إكس غیر مسؤولة عما یلحق البضاعة بحكم طبیعتها من نقص في الحجم أو الوزن أثناء النقل
// والتوصیل، على ألا یزید هذا النقص عن النسبة المقررة طبقا للقواعد العامة المعتمدة في نقل مثل هذه البضاعة.
// تلتزم شركة هوب إكس باستیفاء المبالغ التي اشترطها الطرفان (شركة هوب إكس والمرسل) بموجب عقد
// التوصیل المبرم بین الطرفین استیفاؤها من المرسل إلیه لحساب المرسل عند التسلیم، وإذا تم تسلیم البضاعة
// دون استیفاء تلك المبالغ فتلتزم شركة هوب إكس بدفع تلك المبالغ إلى المرسل دون الإخلال أو التنازل عن حقها
// في الرجوع إلى المرسل إلیه.
// ●	شركة هوب إكس مسؤولة مسؤولیة كاملة عن محتویات الطرود التي تقوم بنقلها وتلتزم بكافة المسؤولیات
// المترتبة على ذلك على أن یلتزم المرسل إذا اقتضى الأمر قیام شركة هوب إكس بفحص الطرود عند استلامها
// بحضور المرسل أو من ینوب عنه للتأكد من محتویاتها وتطلب ذلك فض الأغلفة أو فتح الأوعیة، وجب على
// شركة هوب إكس إرجاع الأغلفة والأوعیة إلى ما كانت علیه، ولشركة هوب إكس الحق في تحمیل المرسل أو
// المرسل إلیه قیمة ما أنفقت حسب مقتضى الحال وطبقا للتكالیف السائدة.
// ●	یكون المرسل مسؤولا عن أي ضرر یلحق بشركة هوب إكس إذا ثبت أن هذا الضرر نتج عن خطأ أو إهمال أو
// تقصیر من المرسل أو موظفیه أو وكلائه.
// ●	إذا كانت طبیعة البضاعة محل النقل تقتضي إعدادا خاصا للنقل وجب على المرسل القیام بذلك على نحو یحمیها
// من الهلاك أو التلف ولا یعرض الأشخاص أو الأشیاء التي تنقل معها للضرر، ویكون المرسل مسؤولا عن
// الأضرار التي تنشأ بسبب إخلاله بهذا الالتزام، وتكون شركة هوب إكس مسؤولة عن الإخلال بهذا الالتزام إذا
// علمت بعدم قیام المرسل بواجب الإعداد الخاص أو إهماله فیه وقامت بعملیة التوصیل.
// ●	للمرسل أن یطلب من شركة هوب إكس بعد تسلمها البضائع بالتوقف عن مباشرة النقل وإعادتها إلیه، أو
// بتوجیهها إلى شخص أخر غیر المرسل إلیه أو إلى عنوان آخر غیر المكان المتفق علیه في وثیقة النقل، أو غیر
// ذلك من التعلیمات مادامت البضاعة في حیازة شركة هوب إكس على أن یدفع المرسل رسوم ما تم من النقل وما
// ترتب من مصروفات وتعویض ما یلحق شركة هوب إكس من ضرر بسبب تنفیذ التعلیمات الجدیدة، ولشركة
// هوب إكس الحق في الامتناع عن تنفیذ التعلیمات الجدیدة في الحالات الآتیة:
// ●	إذا لم یتم تسلیم النسخة الأصلیة من وثیقة النقل الخاصة بالمرسل مبینا فیها تلك التعلیمات مع تعهده وتوقیعه
// بتسدید المصروفات الإضافیة التي تترتب علیها وتعویض الأضرار التي قد تنجم عن تنفیذها.
// ●	إذا كانت تتعارض مع التزامات شركة هوب إكس الأخرى وتؤثر سلبا على سیر أعمالها، وعلى شركة هوب
// إكس إخطار المرسل أو المرسل إلیه بذلك مباشرة بعد تسلمها للتعلیمات وتسجیل هذا الامتناع على نسخة وثیقة
// النقل وإلا كانت مسؤولة عن الخسائر والأضرار الناجمة عن ذلك.

// عند وصول الطرود إلى وجهتها النهائیة یجب على المرسل إلیه أن یقبل تسلم البضاعة، وله حق التحقق من
// سلامتها فإذا امتنعت الشركة عن تمكینه من ذلك جاز له رفض تسلم الطرود.
// بتسلم المرسل إلیه الطرود دون تحفظ یسقط الحق في الرجوع على شركة هوب إكس بسبب التلف أو الهلاك
// الجزئي، مالم یثبت المرسل إلیه حالة البضاعة خلال ثلاثین یوما من تاریخ التسلیم ویكون إثبات حالة البضاعة
// بمعرفة مختصین من الجهة الحكومیة المعنیة أو خبیر تعینه المحكمة المختصة.
// ●	یتسلم المرسل إلیه البضاعة أو الطرد دون تحفظ یسقط الحق في الرجوع على الشركة بالتأخیر في الوصول ما
// لم یرسل التحفظ إلى الشركة خلال( 21) یوما من تاریخ التسلیم.
//  قواعد وإجراءات طلب إعادة الطرود البریدیة
//  في حال طلب العمیل إعادة الشحنة: رسوم إعادة الشحنة هي نفس نصف رسوم الشحن التي دفعها العمیل إزاء توصیل الطرود المتفق على توصیلها. ویتم إعادتها لنفس العنوان الذي تم استلام الشحنة منه. وفي حال تغییر العنوان في هذه الحالة تعتبر
//  .بمثابة شحنة جدیدة
//  تعدیل العنوان المرسل إلیه: إذا كان التعدیل قبل خروج الطرود من المستودع یكون التعدیل مجانا وإذا كان بعد خروج الشحنة .من المستودع، ستكون في هذه الحالة بمثابة شحنة جدیدة إجراءات التعامل مع الشكاوى
// ●	التحقق من صلاحیة قبول شكوى العمیل وفقا للائحة هیئة الاتصالات وشركة ساعد
// ●	فتح بلاغ وتزوید العمیل برقم البلاغ عبر الرسائل النصیة
// ●	متابعة البلاغ من قبل الإدارة المسؤولة
// ●	استلام إفادة سواء سلبیه أو ایجابیه
// ●	إبلاغ العمیل بالإفادة برسالة نصیة بالإجراءات التي تمت لمعالجة شكواه
// ●	فترة معالجة الشكوى لا تزید عن 10 أیام عمل
// ●	في حالة وجود تعویض یتم إبلاغ العمیل بالمستندات المطلوبة
//  قواعد وإجراءات التعامل مع المواد التي تعذر تسلیمها
// ●	إبلاغ العمیل والنص في عقد الخدمة بأن الطرود التي یتعذر تسلیمها سیتم إرجاعها للمستودع وتخزینها لمدة 5
// أیام عمل وبعدها سیتم احتساب أي مبالغ إضافیة مثل أجرة التخزین، وقیمة النقل وقیمة التوصیل في حال قام
// العمیل بطلبها.
// التواصل مع العمیل المستلم لتخییره بین استلام الشحنة من المستودع أو جدولتها للتوصیل في یوم العمل القادم
// (مع توضیح قیمة الفاتورة إجمالا بما فیها قیمة نقل وتوصیل وخلافه.)
// في حالة عدم التجاوب من قبل المستلم بعد مضي الفترة المذكورة یتم التواصل مع المرسل لإرجاع الشحنات إلیه
// برسوم النقل بالإضافة إلى تقدیم خدمة التوصیل إلیه.
// ●	في حالة عدم تجاوب العمیل المرسل أو المستلم یتم تحدیث النظام بحالة الشحنة وإنشاء تذكرة خاصة بذلك، ویتم
// إرسال هذه التذكرة لقسم العملیات والشحن لعمل ما یلزم لتحدیث حالتها على النظام.
// ●	یتم إصدار بولیصة جدیدة برقم جدید للشحنات المتعذر تسلیمها والتي سوف یتم توجیهها إلى المستودع
// المخصص لها ویكون رقم البولیصة القدیمة كمرجع في البولیصة الجدیدة.
// ●	تضاف على البولیصة الجدیدة أي تكالیف طرأت على الشحنة أن وجدت.
// ●	في حالة مضي أكثر من شهر على الشحنة التي تعذر تسلیمها للمستلم النهائي أو المرسل جاز لشركة هوب إكس
// التصرف في الشحنة على النحو التالي:
// ●	بیعها والاحتفاظ بقیمة البضاعة لصالح من له حق التصرف فیها مع اقتطاع أي نفقات تكبدها الناقل أو أي مبالغ
// مستحقة لأي جهة حكومیة
// ●	التقدم بطلب إلى المحكمة المختصة لإثبات حالة البضاعة والإذن للشركة بتعیین حارس قضائي لحساب المرسل
// وعلى مسؤولیته
// ●	تفریغ البضاعة في أي مكان مناسب أو تفریغها إذا كانت معبأة في حاویات طبقا لظروف وطبیعة البضاعة
// ●	التصرف في البضاعة حسبما یري الناقل أن الظروف تقتضي ذلك وفي حدود المعقول. إذا كانت معبأة في
// حاویات طبقا لظروف وطبیعة البضاعة
//  سیاسة الخصوصیة
//  تلتزم شركة هوب إكس بالحفاظ على سریة معلومات المستفید من الخدمات البریدیة وحمایتها من التعدي علیها بأي وسیلة،
//  واتخاذ كافة التدابیر اللازمة لمنع الوصول إلیها أو الاطلاع علیها أو إفشائها أو نشرها أو تعدیلها بما یخالف الأنظمة، كما
//  وتلتزم شركة هوب إكس بعدم الإفصاح عن معلومات المستفیدین ما لم یكن هذا الإفصاح مسموحا به بموجب مسوغ نظامي
//  وفقا للأنظمة المعمول بها في المملكة، أو بناء على موافقة المستفید الصریحة، أو من یمثله رسمیا في ذلك، أو بناء على
//  توجیه من الهیئة، كما وتقید أي اطلاع على معلومات المستفیدین لدیها وتوثق أي دخول على معلوماتهم ،وتحدد وتعرف طلب أغراض جمع وحفظ معلومات المستفیدین، كما وتحافظ على محتوى المواد البریدیة وتحظر على غیر المصرح لهم نظاما  بالاطلاع علیها

//  قواعد حمایة حقوق مستفیدي الخدمات البریدیة
// الرجاء زیارة رابط حقوق مستفیدي الخدمات البریدیة على الرابط التالي:
// https://www.citc.gov.sa/ar/services/licensing/Documents/users-rights-postal.pdf
  ];
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: Text('Terms & Conditions'),
      ),
      body: new SingleChildScrollView(
        child: Padding(
          padding: EdgeInsets.all(4),
          child: Html(
            data: """
    <p>سیاسات وإجراءات التعویضات <br>
<br> ●	للعمیل حق الشكوى لمده 120 یوم من تاریخ إرسال الشحنة 
حق التعویض یكون لمرسل الشحنة
<br> ● في حاله رغبه المرسل في التنازل عن التعویض للمستلم یكون عن طریق وكالة شرعیة
<br> ●	التعویض بقیمة المثل وفقا للائحة هیئة الاتصالات ویتوجب على المرسل توفیر الأوراق المطلوبة للتعویض
وهي كالاتي: <br>
<br> ●	فاتورة أصلیة بقیمة المنتج
<br> ●	صورة البولیصة 
<br> ●	حساب بنكي 
<br> ●	وسوف تعتذر شركة هوب إكس عن التعویض في حالة عدم توافر أي من المتطلبات السابقة
<br> ●	في حالات التلف یحق للمستلم إثبات التلف خلال 24 ساعة من الاستلام وإرفاق صور تثبت حالة الشحنة 
التالفة، في حال شكوى العمیل بعد الوقت المتفق علیه، تعتذر شركة هوب إكس عن قبول الشكوى 
<br> ●	في حالات تأخیر التسلیم عن الوقت المتفق علیه، یتم تعویض العمیل بقیمه الشحن ما عدا الحالات الناتجة عن 
تأخیر بسبب خارج عن الإرادة أو ظروف طارئه أو قوة قاهرة. 
<br> الآثار المترتبة على عدم تنفیذ الخدمة
<br> ● شركة هوب إكس تكون مسؤولة عن الخسارة الناتجة عن تلف أو فقد الطرود وكذلك عن التأخیر في التسلیم إذا
وقع الحادث الذي سبب التلف أو الفقد أو التأخیر في التسلیم في الوقت الذي كانت فیه الطرود في عهدة شركة 
ساعد، إلا إذا ثبت عدم صدور أي خطا أو إهمال من شركة هوب إكس أو من موظفیها تسبب أو ساهم في 
تأخیر تسلیم الطرود أو خسارتها أو تلفها .كما یمكن إعفاء شركة هوب إكس من المسؤولیة إذا ثبت أن تأخیر 
تسلیم البضاعة أو تلفها كلیا أو جزئیا یعود إلى خطأ صادر عن المرسل أو المرسل إلیه أو وكلائهما أو 
ممثلیهما، أو بسبب قوة قاهرة ،أو بسبب عیب كامن في الطرد. وتعفي أیضا من المسؤولیة لأي سبب آخر خارج 
عن سیطرة شركة هوب إكس ویمنعها من تنفیذ بنو د الاتفاقیة. 
<br> ●	شركة هوب إكس غیر مسؤولة عن التأخر في تسلیم البضاعة أو تلفها أو فقدها إذا كان ذلك نتج عن تقدیم 
المرسل بیانات أو معلومات خاطئة عن طبیعة البضاعة في عقد التوصیل أو وثیقة الشحن ویتحمل المرسل كافة 
الخسائر والأضرار في حالة عدم تقدیمه المستندات الكافیة والبیانات والمعلومات المطلوبة أو عدم صحتها أو 
عدم مطابقتها للواقع. 
شركة هوب إكس غیر مسؤولة عما یلحق البضاعة بحكم طبیعتها من نقص في الحجم أو الوزن أثناء النقل 
والتوصیل، على ألا یزید هذا النقص عن النسبة المقررة طبقا للقواعد العامة المعتمدة في نقل مثل هذه البضاعة. 
تلتزم شركة هوب إكس باستیفاء المبالغ التي اشترطها الطرفان (شركة هوب إكس والمرسل) بموجب عقد 
التوصیل المبرم بین الطرفین استیفاؤها من المرسل إلیه لحساب المرسل عند التسلیم، وإذا تم تسلیم البضاعة 
دون استیفاء تلك المبالغ فتلتزم شركة هوب إكس بدفع تلك المبالغ إلى المرسل دون الإخلال أو التنازل عن حقها 
في الرجوع إلى المرسل إلیه. 
<br> ●	شركة هوب إكس مسؤولة مسؤولیة كاملة عن محتویات الطرود التي تقوم بنقلها وتلتزم بكافة المسؤولیات 
المترتبة على ذلك على أن یلتزم المرسل إذا اقتضى الأمر قیام شركة هوب إكس بفحص الطرود عند استلامها 
بحضور المرسل أو من ینوب عنه للتأكد من محتویاتها وتطلب ذلك فض الأغلفة أو فتح الأوعیة، وجب على 
شركة هوب إكس إرجاع الأغلفة والأوعیة إلى ما كانت علیه، ولشركة هوب إكس الحق في تحمیل المرسل أو 
المرسل إلیه قیمة ما أنفقت حسب مقتضى الحال وطبقا للتكالیف السائدة. 
<br> ●	یكون المرسل مسؤولا عن أي ضرر یلحق بشركة هوب إكس إذا ثبت أن هذا الضرر نتج عن خطأ أو إهمال أو 
تقصیر من المرسل أو موظفیه أو وكلائه. 
<br> ●	إذا كانت طبیعة البضاعة محل النقل تقتضي إعدادا خاصا للنقل وجب على المرسل القیام بذلك على نحو یحمیها 
من الهلاك أو التلف ولا یعرض الأشخاص أو الأشیاء التي تنقل معها للضرر، ویكون المرسل مسؤولا عن 
الأضرار التي تنشأ بسبب إخلاله بهذا الالتزام، وتكون شركة هوب إكس مسؤولة عن الإخلال بهذا الالتزام إذا 
علمت بعدم قیام المرسل بواجب الإعداد الخاص أو إهماله فیه وقامت بعملیة التوصیل. 
<br> ●	للمرسل أن یطلب من شركة هوب إكس بعد تسلمها البضائع بالتوقف عن مباشرة النقل وإعادتها إلیه، أو 
بتوجیهها إلى شخص أخر غیر المرسل إلیه أو إلى عنوان آخر غیر المكان المتفق علیه في وثیقة النقل، أو غیر 
ذلك من التعلیمات مادامت البضاعة في حیازة شركة هوب إكس على أن یدفع المرسل رسوم ما تم من النقل وما 
ترتب من مصروفات وتعویض ما یلحق شركة هوب إكس من ضرر بسبب تنفیذ التعلیمات الجدیدة، ولشركة 
هوب إكس الحق في الامتناع عن تنفیذ التعلیمات الجدیدة في الحالات الآتیة: 
<br><br> ●	إذا لم یتم تسلیم النسخة الأصلیة من وثیقة النقل الخاصة بالمرسل مبینا فیها تلك التعلیمات مع تعهده وتوقیعه 
بتسدید المصروفات الإضافیة التي تترتب علیها وتعویض الأضرار التي قد تنجم عن تنفیذها. 
<br><br> ●	إذا كانت تتعارض مع التزامات شركة هوب إكس الأخرى وتؤثر سلبا على سیر أعمالها، وعلى شركة هوب 
إكس إخطار المرسل أو المرسل إلیه بذلك مباشرة بعد تسلمها للتعلیمات وتسجیل هذا الامتناع على نسخة وثیقة 
النقل وإلا كانت مسؤولة عن الخسائر والأضرار الناجمة عن ذلك. 
 
عند وصول الطرود إلى وجهتها النهائیة یجب على المرسل إلیه أن یقبل تسلم البضاعة، وله حق التحقق من 
سلامتها فإذا امتنعت الشركة عن تمكینه من ذلك جاز له رفض تسلم الطرود. 
بتسلم المرسل إلیه الطرود دون تحفظ یسقط الحق في الرجوع على شركة هوب إكس بسبب التلف أو الهلاك 
الجزئي، مالم یثبت المرسل إلیه حالة البضاعة خلال ثلاثین یوما من تاریخ التسلیم ویكون إثبات حالة البضاعة 
بمعرفة مختصین من الجهة الحكومیة المعنیة أو خبیر تعینه المحكمة المختصة. 
<br>●	یتسلم المرسل إلیه البضاعة أو الطرد دون تحفظ یسقط الحق في الرجوع على الشركة بالتأخیر في الوصول ما 
لم یرسل التحفظ إلى الشركة خلال( 21) یوما من تاریخ التسلیم. 
 قواعد وإجراءات طلب إعادة الطرود البریدیة
 في حال طلب العمیل إعادة الشحنة: رسوم إعادة الشحنة هي نفس نصف رسوم الشحن التي دفعها العمیل إزاء توصیل الطرود المتفق على توصیلها. ویتم إعادتها لنفس العنوان الذي تم استلام الشحنة منه. وفي حال تغییر العنوان في هذه الحالة تعتبر
 .بمثابة شحنة جدیدة
 تعدیل العنوان المرسل إلیه: إذا كان التعدیل قبل خروج الطرود من المستودع یكون التعدیل مجانا وإذا كان بعد خروج الشحنة .من المستودع، ستكون في هذه الحالة بمثابة شحنة جدیدة إجراءات التعامل مع الشكاوى
<br>●	التحقق من صلاحیة قبول شكوى العمیل وفقا للائحة هیئة الاتصالات وشركة ساعد 
<br>●	فتح بلاغ وتزوید العمیل برقم البلاغ عبر الرسائل النصیة 
<br>●	متابعة البلاغ من قبل الإدارة المسؤولة 
<br>●	استلام إفادة سواء سلبیه أو ایجابیه 
<br>●	إبلاغ العمیل بالإفادة برسالة نصیة بالإجراءات التي تمت لمعالجة شكواه 
<br>●	فترة معالجة الشكوى لا تزید عن 10 أیام عمل 
<br>●	في حالة وجود تعویض یتم إبلاغ العمیل بالمستندات المطلوبة 
 قواعد وإجراءات التعامل مع المواد التي تعذر تسلیمها
<br>●	إبلاغ العمیل والنص في عقد الخدمة بأن الطرود التي یتعذر تسلیمها سیتم إرجاعها للمستودع وتخزینها لمدة 5 
أیام عمل وبعدها سیتم احتساب أي مبالغ إضافیة مثل أجرة التخزین، وقیمة النقل وقیمة التوصیل في حال قام 
العمیل بطلبها. 
التواصل مع العمیل المستلم لتخییره بین استلام الشحنة من المستودع أو جدولتها للتوصیل في یوم العمل القادم 
(مع توضیح قیمة الفاتورة إجمالا بما فیها قیمة نقل وتوصیل وخلافه.) 
في حالة عدم التجاوب من قبل المستلم بعد مضي الفترة المذكورة یتم التواصل مع المرسل لإرجاع الشحنات إلیه 
برسوم النقل بالإضافة إلى تقدیم خدمة التوصیل إلیه. 
<br>●	في حالة عدم تجاوب العمیل المرسل أو المستلم یتم تحدیث النظام بحالة الشحنة وإنشاء تذكرة خاصة بذلك، ویتم 
إرسال هذه التذكرة لقسم العملیات والشحن لعمل ما یلزم لتحدیث حالتها على النظام. 
<br>●	یتم إصدار بولیصة جدیدة برقم جدید للشحنات المتعذر تسلیمها والتي سوف یتم توجیهها إلى المستودع 
المخصص لها ویكون رقم البولیصة القدیمة كمرجع في البولیصة الجدیدة. 
<br>●	تضاف على البولیصة الجدیدة أي تكالیف طرأت على الشحنة أن وجدت. 
<br>●	في حالة مضي أكثر من شهر على الشحنة التي تعذر تسلیمها للمستلم النهائي أو المرسل جاز لشركة هوب إكس 
التصرف في الشحنة على النحو التالي: 
<br>●	بیعها والاحتفاظ بقیمة البضاعة لصالح من له حق التصرف فیها مع اقتطاع أي نفقات تكبدها الناقل أو أي مبالغ 
مستحقة لأي جهة حكومیة 
<br>●	التقدم بطلب إلى المحكمة المختصة لإثبات حالة البضاعة والإذن للشركة بتعیین حارس قضائي لحساب المرسل 
وعلى مسؤولیته 
<br>●	تفریغ البضاعة في أي مكان مناسب أو تفریغها إذا كانت معبأة في حاویات طبقا لظروف وطبیعة البضاعة 
<br>●	التصرف في البضاعة حسبما یري الناقل أن الظروف تقتضي ذلك وفي حدود المعقول. إذا كانت معبأة في 
حاویات طبقا لظروف وطبیعة البضاعة 
 سیاسة الخصوصیة
 تلتزم شركة هوب إكس بالحفاظ على سریة معلومات المستفید من الخدمات البریدیة وحمایتها من التعدي علیها بأي وسیلة،
 واتخاذ كافة التدابیر اللازمة لمنع الوصول إلیها أو الاطلاع علیها أو إفشائها أو نشرها أو تعدیلها بما یخالف الأنظمة، كما
 وتلتزم شركة هوب إكس بعدم الإفصاح عن معلومات المستفیدین ما لم یكن هذا الإفصاح مسموحا به بموجب مسوغ نظامي
 وفقا للأنظمة المعمول بها في المملكة، أو بناء على موافقة المستفید الصریحة، أو من یمثله رسمیا في ذلك، أو بناء على
 توجیه من الهیئة، كما وتقید أي اطلاع على معلومات المستفیدین لدیها وتوثق أي دخول على معلوماتهم ،وتحدد وتعرف طلب أغراض جمع وحفظ معلومات المستفیدین، كما وتحافظ على محتوى المواد البریدیة وتحظر على غیر المصرح لهم نظاما  بالاطلاع علیها
 
 
 قواعد حمایة حقوق مستفیدي الخدمات البریدیة
الرجاء زیارة رابط حقوق مستفیدي الخدمات البریدیة على الرابط التالي: 
https://www.citc.gov.sa/ar/services/licensing/Documents/users-rights-postal.pdf
</p>
  """,
            //Optional parameters:
            // padding: EdgeInsets.all(8.0),
            // linkStyle: const TextStyle(
            //   color: Colors.redAccent,
            //   decorationColor: Colors.redAccent,
            //   decoration: TextDecoration.underline,
            // ),
            // onLinkTap: (url) {
            //   print("Opening $url...");
            // },
            // onImageTap: (src) {
            //   print(src);
            // },
            //Must have useRichText set to false for this to work
            // customRender: (node, children) {
            //   if (node is dom.Element) {
            //     switch (node.localName) {
            //       case "custom_tag":
            //         return Column(children: children);
            //     }
            //   }
            //   return null;
            // },
            // customTextAlign: (dom.Node node) {
            //   if (node is dom.Element) {
            //     switch (node.localName) {
            //       case "p":
            //         return TextAlign.justify;
            //     }
            //   }
            //   return null;
            // },
            // customTextStyle: (dom.Node node, TextStyle baseStyle) {
            //   if (node is dom.Element) {
            //     switch (node.localName) {
            //       case "p":
            //         return baseStyle.merge(TextStyle(height: 2, fontSize: 20));
            //     }
            //   }
            //   return baseStyle;
            // },
          ),
        ),
      ),
    );
  }
}
